In [8]:
### PROCESO DE LIMPIEZA DE LAS TABLAS DE ENTRADA ###

In [3]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [4]:
###Load data tabla actor###

actor = pd.read_csv('../data/actor.csv', encoding = 'latin1')

In [5]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [6]:
actor.shape

(200, 4)

In [7]:
#ver el contenido
actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [15]:
#mostrar registros duplicados
actor.drop_duplicates().shape, actor.shape
##no hay duplicados

((200, 4), (200, 4))

In [16]:
##hay nulos
nan_cols = actor.isna().sum()
nan_cols[nan_cols>0]

Series([], dtype: int64)

In [18]:
##Borrar la columna last-update porque todos los datos son iguales

In [17]:
###Load data tabla category###

category = pd.read_csv('../data/category.csv', encoding = 'latin1')

In [18]:
category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [19]:
category.shape

(16, 3)

In [20]:
#ver el contenido
category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [21]:
#mostrar registros duplicados
category.drop_duplicates().shape, category.shape
##no hay duplicados

((16, 3), (16, 3))

In [22]:
## no hay nulos
nan_cols = category.isna().sum()
nan_cols[nan_cols>0]

Series([], dtype: int64)

In [77]:
##Borrar la columna last-update porque todos los datos son iguales

In [23]:
###Load data tabla film###

film = pd.read_csv('../data/film.csv', encoding = 'latin1')

In [24]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [25]:
film.shape

(1000, 13)

In [26]:
#ver el contenido
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [27]:
#mostrar registros duplicados
film.drop_duplicates().shape, film.shape
##no hay duplicados

((1000, 13), (1000, 13))

In [28]:
##hay nulos
nan_cols = film.isna().sum()
nan_cols[nan_cols>0]

original_language_id    1000
dtype: int64

In [29]:
#borrar columna original_language_id
film.drop(['original_language_id'], axis=1, inplace=True)

In [30]:
film.shape

(1000, 12)

In [ ]:
##Borrar la columna last-update porque todos los datos son iguales

In [31]:
###Load data tabla inventory###

inventory = pd.read_csv('../data/inventory.csv', encoding = 'latin1')

In [32]:
inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [33]:
inventory.shape

(1000, 4)

In [34]:
#ver el contenido
inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [35]:
#mostrar registros duplicados
inventory.drop_duplicates().shape, inventory.shape
##no hay duplicados

((1000, 4), (1000, 4))

In [36]:
##hay nulos
nan_cols = inventory.isna().sum()
nan_cols[nan_cols>0]
#no hay nulos

Series([], dtype: int64)

In [123]:
##Borrar la columna last-update porque todos los datos son iguales

In [37]:
###Load data tabla language###

language = pd.read_csv('../data/language.csv', encoding = 'latin1')

In [129]:
language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [38]:
language.shape

(6, 3)

In [40]:
#ver el contenido
language.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 1016.0 bytes

In [43]:
#mostrar registros duplicados
language.drop_duplicates().shape, language.shape
##no hay duplicados

((6, 3), (6, 3))

In [45]:
##hay nulos
nan_cols = language.isna().sum()
nan_cols[nan_cols>0]
#no hay nulos

Series([], dtype: int64)

In [138]:
##Borrar la columna last-update porque todos los datos son iguales

In [47]:
###Load data tabla old_HDD###

old = pd.read_csv('../data/old_HDD.csv', encoding = 'latin1')

In [48]:
old.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [49]:
old.shape

(1000, 5)

In [50]:
#ver el contenido
old.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 207.6 KB

In [51]:
#mostrar registros duplicados
old.drop_duplicates().shape, old.shape
##no hay duplicados

((1000, 5), (1000, 5))

In [52]:
##hay nulos
nan_cols = old.isna().sum()
nan_cols[nan_cols>0]
#no hay nulos

Series([], dtype: int64)

In [53]:
###Load data tabla rental###

rental = pd.read_csv('../data/rental.csv', encoding = 'latin1')

In [54]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [55]:
rental.shape

(1000, 7)

In [56]:
#ver el contenido
rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

In [57]:
#mostrar registros duplicados
rental.drop_duplicates().shape, rental.shape
##no hay duplicados

((1000, 7), (1000, 7))

In [59]:
##hay nulos
nan_cols = rental.isna().sum()
nan_cols[nan_cols>0]
#no hay nulos

Series([], dtype: int64)

In [60]:
##Exportar datos filtrados
actor.to_csv('../data/actor_clean.csv',index=False)
category.to_csv('../data/category_clean.csv',index=False)
film.to_csv('../data/film_clean.csv',index=False)
inventory.to_csv('../data/inventory_clean.csv',index=False)
language.to_csv('../data/language_clean.csv',index=False)
old.to_csv('../data/old_clean.csv',index=False)
rental.to_csv('../data/rental_clean.csv',index=False)